PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/application/testPCP/Z4A/mai_main.c
/**
 * @file mai_main.c
 *   C entry function. The core completes the HW initialization (clocks run at full speed,
 * drivers for MPU and devices are initialized).\n
 *   The safe-RTOS is configured to run a few tasks to double-check some aspects of the
 * scheduler, particular of the priority ceiling protocol.\n
 *   Only if the first LED (DS11, closed to the border of the PCB) is blinking everything
 * is alright.\n
 *   Progress information is permanently written into the serial output channel. A terminal
 * on the development host needs to use these settings: 115000 Bd, 8 Bit data word, no
 * parity, 1 stop bit.
 *
 * Copyright (C) 2017-2024 Peter Vranken (mailto:Peter_Vranken@Yahoo.de)
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the GNU Lesser General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or any later
 * version.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License
 * for more details.
 *
 * You should have received a copy of the GNU Lesser General Public License
 * along with this program. If not, see <http://www.gnu.org/licenses/>.
 */
/* Module interface
 *   main
 * Local functions
 *   taskInitProcess
 *   isrPit1
 *   isrPit2
 *   isrPit3
 *   checkTotalCount
 *   taskA
 *   taskB
 *   taskH
 *   taskO
 *   taskT
 *   taskS
 *   osInstallInterruptServiceRoutines
 */

/*
 * Include files
 */

//#include "mai_main.h"

#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <math.h>
#include <assert.h>

#include "MPC5748G.h"
#include "typ_types.h"
#include "ccl_configureClocks.h"
#include "xbs_crossbarSwitch.h"
#include "stm_systemTimer.h"
#include "lbd_ledAndButtonDriver.h"
#include "dma_dmaDriver.h"
#include "sio_serialIO.h"
#include "rtos.h"
#include "del_delay.h"


/*
 * Defines
 */

/** A wrapper around the API for the priority ceiling protocal (PCP), which lets the API
    for mutual exclusion of a task set look like the API calls from the OSEK/VDX standard.
      Here, for getting the resource, i.e., for entering a critical section of code. */
#define GetResource(resource)                                                               \
            {   uint32_t priorityLevelSoFar;                                                \
                priorityLevelSoFar = rtos_suspendAllTasksByPriority                         \
                                                (/* suspendUpToThisPriority */ (resource));

/** A wrapper around the API for the priority ceiling protocal (PCP), which lets the API
    for mutual exclusion of a task set look like the API calls from the OSEK/VDX standard.
      Here, for returning the resource, i.e., for leaving a critical section of code. */
#define ReleaseResource() rtos_resumeAllTasksByPriority(priorityLevelSoFar); }

/** A wrapper around the API for the priority ceiling protocal (PCP), which lets the API
    for mutual exclusion of a task set look like the API calls from the OSEK/VDX standard.
      Here, for getting the resource, i.e., for entering a critical section of code.\n
      Here for OS tasks (including idle task). */
#define osGetResource(resource)                                                             \
            {   uint32_t priorityLevelSoFar;                                                \
                priorityLevelSoFar = rtos_osSuspendAllTasksByPriority                       \
                                                (/* suspendUpToThisPriority */ (resource));

/** A wrapper around the API for the priority ceiling protocal (PCP), which lets the API
    for mutual exclusion of a task set look like the API calls from the OSEK/VDX standard.\n
      Here, for returning the resource, i.e., for leaving a critical section of code.\n
      Here for OS tasks (including idle task). */
#define osReleaseResource() rtos_osResumeAllTasksByPriority(priorityLevelSoFar); }

/** Some helper code to get the maximum task priority as a constant for the priority ceiling
    protocol. */
#define MAXP(p1,p2)  ((p2)>(p1)?(p2):(p1))

/** The priority level to set for the atomic operations done on the task cycle counts. The
    macro is named such that the code resembles the resource API from the OSEK/VDX
    standard.\n
      Here for mutual exclusion of all participating tasks. */
#define RESOURCE_ALL    (MAXP(prioEvT,MAXP(prioEvH,MAXP(prioEvA,prioEvB))))

/** The priority level to set for the atomic operations done on the task cycle counts.\n
      Here for mutual exclusion of tasks A, B and H. (Note, this implicitly includes T, if
    H has a higher priority than T.) */
#define RESOURCE_A_B_H  (MAXP(prioEvH,MAXP(prioEvA,prioEvB)))

/** The priority level to set for the atomic operations done on the task cycle counts.\n
      Here for mutual exclusion of tasks A, B and T. */
#define RESOURCE_A_B_T  (MAXP(prioEvT,MAXP(prioEvA,prioEvB)))

/** Error catching for DEBUG and PRODUCTION compilation. */
#define ASSERT(cond)  ({if(!(cond)){success = false; assert(false);}})


/*
 * Local type definitions
 */

/** The enumeration of all event processors, tasks and priorities, to have them as symbols
    in the source code. Most relevant are the event processor IDs. Actually, these IDs are
    provided by the RTOS at runtime, when creating the event processor. However, it is
    guaranteed that the IDs, which are dealt out by rtos_osCreateEventProcessor() form the
    series 0, 1, 2, .... So we don't need to have a dynamic storage of the IDs; we define
    them as constants and double-check by assertion that we got the correct, expected IDs
    from rtos_osCreateEventProcessor(). Note, this requires that the order of creating the
    event processors follows the order here in the enumeration.\n
      Here, we have the IDs of the created event processors. They occupy the index range
    starting from zero. */
enum idEventProcessor_t
{
    idEvTaskA = 0,  /// EvProc for low priority task, which raise prio with PCP
    idEvTaskB,      /// EvProc for successor task of same priority
    idEvTaskH,      /// EvProc for task of higer priority, which can preempt A, B
    idEvTaskT,      /// EvProc for cyclic task
    idEvTaskS,      /// EvProc for cyclic supervisor task in other process

    /** The number of tasks to register. */
    noRegisteredEvProcs
};


/** The RTOS uses constant priorities for its event processors, which are defined here.\n
      Note, the priority is a property of an event processor rather than of a task. A task implicitly
    inherits the priority of the event processor it is associated with. */
enum prioTask_t
{
    prioTaskIdle = 0,            /* Prio 0 is implicit, cannot be chosen explicitly */
    prioEvA = 3,
    prioEvB = prioEvA,
    prioEvT = prioEvA+2,
    prioEvH = prioEvT+4,
    prioEvS = 11,
};


/** The INTC priorities of the interrupts in use. These priorities constitute another space
    as the task priorities. */
enum prioIRQ_t
{
    prioIrqPit1 = RTOS_KERNEL_IRQ_PRIORITY_CORE_0-2,   /** INTC priority of timer IRQ PIT1 */
    prioIrqPit2 = RTOS_KERNEL_IRQ_PRIORITY_CORE_0,     /** INTC priority of timer IRQ PIT2 */
    prioIrqPit3 = RTOS_KERNEL_IRQ_PRIORITY_CORE_0+3,   /** INTC priority of timer IRQ PIT3 */
};


/** In safe-RTOS a task belongs to a process, characterized by the PID, 1..4. The
    relationship is defined here.\n
      Note, a process needs to be configured in the linker script (actually: assignment of
    stack space) before it can be used. */
enum pidOfTask_t
{
    pidOs = 0,              /* Kernel always and implicitly has PID 0 */
    pidTaskA = 1,
    pidTaskB = pidTaskA,
    pidTaskO = pidOs,
    pidTaskH = pidTaskA,
    pidTaskT = 1,           /// @todo Try third process and use shared memory
    pidTaskS = 2,
};




