PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/application/testPCP/Z4A/mai_main.c
/*
 * Local prototypes
 */

/** We preferrably use 64 Bit types for the counter to have a higher risk of harmful race
    conditions. */
typedef unsigned long long counter64_t;


/*
 * Data definitions
 */

/** Counter of calls of ISR for PIT1 interrupt. */
volatile counter64_t SBSS_OS(mai_cntISRPit1) = 0;

/** Counter of calls of ISR for PIT2 interrupt. */
volatile counter64_t SBSS_OS(mai_cntISRPit2) = 0;

/** Counter of calls of ISR for PIT3 interrupt. */
volatile counter64_t SBSS_OS(mai_cntISRPit3) = 0;

/** Counter of cycles of infinite main loop. */
volatile counter64_t SBSS_OS(mai_cntTaskIdle) = 0;

/** Counter of event task A. */
volatile counter64_t SBSS_P1(mai_cntTaskA) = 0;

/** Counter of event task B. */
volatile counter64_t SBSS_P1(mai_cntTaskB) = 0;

/** Counter of task O. */
volatile counter64_t SBSS_OS(mai_cntTaskO) = 0;

/** Counter of event task H. */
volatile counter64_t SBSS_P1(mai_cntTaskH) = 0;

/** Copy of counter of event task H. */
volatile counter64_t SBSS_P1(mai_copyOfCntTaskH) = 0;

/** Counter of timer task T. */
volatile counter64_t SBSS_P1(mai_cntTaskT) = 0;

/** Sum of counters of tasks A, B, O, H and T. Used for test of coherent data access. */
volatile counter64_t SHARED(mai_cntTotalOfAllTasks) = 0;

/** Counter of cyclic task S. */
volatile counter64_t SBSS_P2(mai_cntTaskS) = 0;


/*
 * Function implementation
 */

/**
 * Initialization task of process \a PID.
 *   @return
 * The function returns the Boolean descision, whether the initialization was alright and
 * the system can start up. "Not alright" is expressed by a negative number, which hinders
 * the RTOS to startup.
 *   @param PID
 * The ID of the process, the task function is executed in.
 *   @remark
 * In this sample, we demonstrate that different processes' tasks can share the same task
 * function implementation. This is meant a demonstration of the technical feasibility but
 * not of good practice; the implementation needs to use shared memory, which may break a
 * safety constraint, and it needs to consider the different privileges of the processes.
 */
static int32_t taskInitProcess(uint32_t PID)
{
    _Static_assert(prioEvA <= RTOS_MAX_LOCKABLE_TASK_PRIORITY
                   &&  prioEvB <= RTOS_MAX_LOCKABLE_TASK_PRIORITY
                   &&  prioEvH <= RTOS_MAX_LOCKABLE_TASK_PRIORITY
                   &&  prioEvT <= RTOS_MAX_LOCKABLE_TASK_PRIORITY
                   &&  prioEvS >= RTOS_MAX_LOCKABLE_TASK_PRIORITY
                   &&  prioEvS <= RTOS_MAX_TASK_PRIORITY
                  , "Bad task priority configuration"
                  );
    static unsigned int SHARED(cnt_) = 0;
    ++ cnt_;

    /* Scheduler test: Check order of initialization calls. */
    assert(cnt_ == PID);
    return cnt_ == PID? 0: -1;

} /* End of taskInitProcess */



/**
 * A regularly triggered interrupt handler for the timer PIT1. The interrupt does nothing
 * but counting a variable. It is triggered at medium frequency and asynchronously to the
 * kernel's clock tick to prove the system stability and properness of the context
 * switches.
 *   @remark
 * This is a normal interrupt running in the kernel context (supervisor mode, no MPU
 * restrictions).
 */
static void isrPit1(void)
{
    ++ mai_cntISRPit1;

    /* RM 51.4.11, p. 2738f: Acknowledge the timer interrupt in the causing HW device. Can
       be done as this is "trusted code" that is running in supervisor mode. */
    PIT->TIMER[1].TFLG = PIT_TFLG_TIF(1);

} /* End of isrPit1 */



/**
 * A regularly triggered interrupt handler for the timer PIT2. The interrupt does nothing
 * but counting a variable. It is triggered at high frequency and asynchronously to the
 * kernel's clock tick to prove the system stability and properness of the context switches.
 *   @remark
 * This is a normal interrupt running in the kernel context (supervisor mode, no MPU
 * restrictions).
 */
static void isrPit2(void)
{
    ++ mai_cntISRPit2;

    /* RM 51.4.11, p. 2738f: Acknowledge the timer interrupt in the causing HW device. Can
       be done as this is "trusted code" that is running in supervisor mode. */
    PIT->TIMER[2].TFLG = PIT_TFLG_TIF(1);

} /* End of isrPit2 */



/**
 * A regularly triggered interrupt handler for the timer PIT3. The interrupt does nothing
 * but counting a variable. It is triggered at high frequency and asynchronously to the
 * kernel's clock tick to prove the system stability and properness of the context switches.
 *   @remark
 * This is a normal interrupt running in the kernel context (supervisor mode, no MPU
 * restrictions).
 */
static void isrPit3(void)
{
    ++ mai_cntISRPit3;

    /* RM 51.4.11, p. 2738f: Acknowledge the timer interrupt in the causing HW device. Can
       be done as this is "trusted code" that is running in supervisor mode. */
    PIT->TIMER[3].TFLG = PIT_TFLG_TIF(1);

} /* End of isrPit3 */


/**
 * Check the consistency of the global data to detect harmful and unexpected race
 * conditions.
 *   @return
 * \a true if everything is still alright, \a false otherwise.
 */
static bool checkTotalCount(void)
{
    /* Supervisory task S can't have mutual exclusion with the normal worker tasks. It must
       not participate the consistency check. */
    return mai_cntTaskIdle + mai_cntTaskA + mai_cntTaskB + mai_cntTaskH + mai_cntTaskT
           + mai_cntTaskO
           == mai_cntTotalOfAllTasks;

} /* End of checkTotalCount */



/**
 * Task A. Accesses data in a critical section shaped with PCP.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process. This mechanism is used to report a problem in PRODUCTION
 * compilation, when we have no assertions available.
 *   @param PID
 * The ID of the process, the task function is executed in.
 *   @param taskParam
 * A variable task parameter. Here just used for testing.
 */
static int32_t taskA(uint32_t PID ATTRIB_UNUSED, uint32_t taskParam)
{
    bool success = true;

    ASSERT(taskParam == (uint32_t)mai_cntTaskA);

    /* Concept: Tasks B and H are event triggered by A and have no race conditions with
       each other. H has higher priority as A and B, which have the same priority. Task T
       can preempt.
         A triggers H and double checks immediate increase of its counter.
         A raises the current priority level and repeats the same. H's counter must not
       increase.
         A lowers the priority again and checks for immediate increase of H's counter.
         Same with priority raised to a level, which doesn't include H. A needs to see an
      immediate increase of H's counter, i.e., before lowering the priority again.
         A raises the priority to a level which includes T and blocks for a while, which is
       longer than the cycle time of T. It checks for an increase of the activation loss
       counter of T.
         A lowers the priority to a level which doesn't include T any longer and blocks for
       a while, which is longer than the cycle time of T. It checks for no further
       activation losses of T, i.e., T is now running and preempting A.
         A raises the priority level so that H is included. It stores the counter value of
       H (for task B) and terminates gracefully. H needs to be immediately called due to
       the implicit lowering of the priority at the end of task A. Task B will check for an
       increase of H's counter. */

