PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/application/testPCP/Z4A/mai_main.c
    /* A triggers H and double checks immediate increase of its counter. */
    counter64_t tmpCntH = mai_cntTaskH;
    bool evCouldBeTriggered = rtos_sendEvent(idEvTaskH, /* taskParam */ 0);
    ASSERT(tmpCntH+1 == mai_cntTaskH);
    tmpCntH = mai_cntTaskH;
    ASSERT(evCouldBeTriggered);

    /* Use PCP to hinder the triggered task from immediate activation. */
    GetResource(RESOURCE_ALL);
    evCouldBeTriggered = rtos_sendEvent(idEvTaskH, /* taskParam */ 0);
    /* There must be no counter change now. */
    ASSERT(tmpCntH == mai_cntTaskH);
    ASSERT(evCouldBeTriggered);

    /* Use PCP the release tasks of higher priority. */
    ReleaseResource();
    /* Task H must execute immediately and before we have the chance to do anything else. */
    ASSERT(tmpCntH+1 == mai_cntTaskH);
    tmpCntH = mai_cntTaskH;

    /* Use PCP to raise priority but not to the extend that is observable but doesn't
       hinder the triggered task from immediate activation yet. */
    GetResource(RESOURCE_A_B_T);
    const counter64_t tmpCntT = mai_cntTaskT;
    evCouldBeTriggered = rtos_sendEvent(idEvTaskH, /* taskParam */ 0);
    /* There must be an immediate counter change. */
    ASSERT(tmpCntH+1 == mai_cntTaskH);
    tmpCntH = mai_cntTaskH;
    ASSERT(evCouldBeTriggered);
    /* Task T must be blocked. We check this by busy wait such long that T needs to undergo
       at least one activation loss. */
    uint32_t noActivationLoss = rtos_getNoActivationLoss(idEvTaskT);
    del_delayMicroseconds(/* tiCpuInUs */ 4100);
    ASSERT(noActivationLoss < rtos_getNoActivationLoss(idEvTaskT)
           || noActivationLoss == UINT_MAX
          );
    ASSERT(tmpCntT == mai_cntTaskT);
    evCouldBeTriggered = rtos_sendEvent(idEvTaskH, /* taskParam */ 0);
    /* There must be an immediate counter change. */
    ASSERT(tmpCntH+1 == mai_cntTaskH);
    tmpCntH = mai_cntTaskH;
    ASSERT(evCouldBeTriggered);

    /* A lowers the priority such that T will be served again. No more activation losses
       should be observed. Moreover, as we saw at least one loss, we know that the event
       must be triggered now. We need to see at least one immediate cycle from T. */
    ASSERT(tmpCntT == mai_cntTaskT);
    _Static_assert(prioEvT > prioEvA+1, "Undesired priority configuration");
    rtos_resumeAllTasksByPriority(prioEvT-1);
    ASSERT(tmpCntT+1 <= mai_cntTaskT);
    noActivationLoss = rtos_getNoActivationLoss(idEvTaskT);
    del_delayMicroseconds(/* tiCpuInUs */ 4100);
    ASSERT(noActivationLoss == rtos_getNoActivationLoss(idEvTaskT));
    evCouldBeTriggered = rtos_sendEvent(idEvTaskH, /* taskParam */ 0);
    /* There must be an immediate counter change. */
    ASSERT(tmpCntH+1 == mai_cntTaskH);
    tmpCntH = mai_cntTaskH;
    ASSERT(evCouldBeTriggered);
    ReleaseResource();

    GetResource(RESOURCE_ALL);
    ++ mai_cntTaskA;
    ++ mai_cntTotalOfAllTasks;
    ASSERT(checkTotalCount());
    ReleaseResource();

    /* A triggers B. There must be no immediate counter change because of the same
       priority. */
    const counter64_t tmpCntB = mai_cntTaskB;
    evCouldBeTriggered = rtos_sendEvent(idEvTaskB, /* taskParam */ (uint32_t)mai_cntTaskB);
    ASSERT(tmpCntB == mai_cntTaskB);
    ASSERT(evCouldBeTriggered);

    /* A blocks and triggers H and leaves without releasing the lock. The scheduler needs
       to take care. */
    GetResource(RESOURCE_ALL);
    evCouldBeTriggered = rtos_sendEvent(idEvTaskH, /* taskParam */ 0);
    /* There must be no immediate counter change because of the lock. */
    ASSERT(tmpCntH == mai_cntTaskH);
    mai_copyOfCntTaskH = tmpCntH;
    ASSERT(evCouldBeTriggered);
    /* Instead of ReleaseResource: */ ASSERT(priorityLevelSoFar == prioEvA);}

    return success? 0: -1;

} /* End of taskA */



/**
 * Task B, the successor of task A. B is explicitly triggered by A.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process. This mechanism is used to report a problem in PRODUCTION
 * compilation, when we have no assertions available.
 *   @param PID
 * The ID of the process, the task function is executed in.
 *   @param taskParam
 * A variable task parameter. Here just used for testing.
 */
static int32_t taskB(uint32_t PID ATTRIB_UNUSED, uint32_t taskParam)
{
    bool success = true;

    ASSERT(taskParam == (uint32_t)mai_cntTaskB);

    /* Task H needs to have executed after leaving A but before entering B. */
    ASSERT(mai_copyOfCntTaskH+1 == mai_cntTaskH);

    GetResource(RESOURCE_ALL);
    ++ mai_cntTaskB;
    ++ mai_cntTotalOfAllTasks;
    ASSERT(checkTotalCount());
    ReleaseResource();

    /* A, B and O need to be always in sync. There are no race conditions. */
    ASSERT(mai_cntTaskA == mai_cntTaskB  &&  mai_cntTaskB == mai_cntTaskO+1);

    /* B blocks and triggers H and leaves without releasing the lock. The scheduler needs
       to take care. */
    GetResource(RESOURCE_ALL);
    const counter64_t tmpCntH = mai_cntTaskH;
    const bool evCouldBeTriggered = rtos_sendEvent(idEvTaskH, /* taskParam */ 0);
    /* There must be no immediate counter change because of the lock. */
    ASSERT(tmpCntH == mai_cntTaskH);
    mai_copyOfCntTaskH = tmpCntH;
    ASSERT(evCouldBeTriggered);
    /* Instead of ReleaseResource: */ ASSERT(priorityLevelSoFar == prioEvB);}

    return success? 0: -1;

} /* End of taskB */




/**
 * Task O, the successor of task B. O is associated with the same event processor as triggers B.
 *   @param taskParam
 * A variable task parameter. Here not used.
 *   @param taskParam
 * A variable task parameter. Here just used for testing.
 */
static void taskO(uint32_t taskParam)
{
    bool success = true;

    ASSERT(taskParam+1 == (uint32_t)mai_cntTaskB);

    /* Task H needs to have executed after leaving B but before entering O. */
    ASSERT(mai_copyOfCntTaskH+1 == mai_cntTaskH);

    /* In task O, we repeat most of the tests from task A to see if the OS API works the
       same as the user mode API. */

    /* O triggers H and double checks immediate increase of its counter. */
    counter64_t tmpCntH = mai_cntTaskH;
    bool evCouldBeTriggered = rtos_osSendEvent(idEvTaskH, /* taskParam */ 0);
    ASSERT(tmpCntH+1 == mai_cntTaskH);
    tmpCntH = mai_cntTaskH;
    ASSERT(evCouldBeTriggered);

