PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/application/testPCP/Z4A/mai_main.c
    /* Use PCP to hinder the triggered task from immediate activation. */
    osGetResource(RESOURCE_ALL);
    evCouldBeTriggered = rtos_osSendEvent(idEvTaskH, /* taskParam */ 0);
    /* There must be no counter change now. */
    ASSERT(tmpCntH == mai_cntTaskH);
    ASSERT(evCouldBeTriggered);

    /* Use PCP the release tasks of higher priority. */
    osReleaseResource();
    /* Task H must execute immediately and before we have the chance to do anything else. */
    ASSERT(tmpCntH+1 == mai_cntTaskH);
    tmpCntH = mai_cntTaskH;

    /* Use PCP to raise priority but not to the extend that is observable but doesn't
       hinder the triggered task from immediate activation yet. */
    osGetResource(RESOURCE_A_B_T);
    const counter64_t tmpCntT = mai_cntTaskT;
    evCouldBeTriggered = rtos_osSendEvent(idEvTaskH, /* taskParam */ 0);
    /* There must be an immediate counter change. */
    ASSERT(tmpCntH+1 == mai_cntTaskH);
    tmpCntH = mai_cntTaskH;
    ASSERT(evCouldBeTriggered);
    /* Task T must be blocked. We check this by busy wait such long that T needs to undergo
       at least one activation loss. */
    uint32_t noActivationLoss = rtos_getNoActivationLoss(idEvTaskT);
    del_delayMicroseconds(/* tiCpuInUs */ 4100);
    ASSERT(noActivationLoss < rtos_getNoActivationLoss(idEvTaskT)
           || noActivationLoss == UINT_MAX
          );
    ASSERT(tmpCntT == mai_cntTaskT);
    evCouldBeTriggered = rtos_osSendEvent(idEvTaskH, /* taskParam */ 0);
    /* There must be an immediate counter change. */
    ASSERT(tmpCntH+1 == mai_cntTaskH);
    tmpCntH = mai_cntTaskH;
    ASSERT(evCouldBeTriggered);

    /* O lowers the priority such that T will be served again. No more activation losses
       should be observed. Moreover, as we saw at least one loss, we know that the event
       must be triggered now. We need to see at least one immediate cycle from T. */
    ASSERT(tmpCntT == mai_cntTaskT);
    _Static_assert(prioEvT > prioEvB+1, "Undesired priority configuration");
    rtos_osResumeAllTasksByPriority(prioEvT-1);
    ASSERT(tmpCntT+1 <= mai_cntTaskT);
    noActivationLoss = rtos_getNoActivationLoss(idEvTaskT);
    del_delayMicroseconds(/* tiCpuInUs */ 4100);
    ASSERT(noActivationLoss == rtos_getNoActivationLoss(idEvTaskT));
    evCouldBeTriggered = rtos_osSendEvent(idEvTaskH, /* taskParam */ 0);
    /* There must be an immediate counter change. */
    ASSERT(tmpCntH+1 == mai_cntTaskH);
    tmpCntH = mai_cntTaskH;
    ASSERT(evCouldBeTriggered);
    osReleaseResource();

    osGetResource(RESOURCE_ALL);
    ++ mai_cntTaskO;
    ++ mai_cntTotalOfAllTasks;
    ASSERT(checkTotalCount());
    osReleaseResource();

    /* A, B and O need to be always in sync. There are no race conditions. */
    ASSERT(mai_cntTaskA == mai_cntTaskB  &&  mai_cntTaskB == mai_cntTaskO);

    /* Implementation problem: No error reporting is offered by the RTOS for OS tasks. For
       PRODUCTION compilation and if we detected a problem then we have to report it
       somehow differently. We inject another error, which will be handled at latest in the
       next user mode task. */
    if(!success)
    {
        osGetResource(RESOURCE_ALL);
        -- mai_cntTaskO;
        osReleaseResource();
    }
} /* End of taskO */




/**
 * Event task H, which is of higher priority as A and B. It must not have
 * any race conditions with these as it is triggered only (and synchronously) by A.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process. This mechanism is used to report a problem in PRODUCTION
 * compilation, when we have no assertions available.
 *   @param PID
 * The ID of the process, the task function is executed in.
 *   @param taskParam
 * A variable task parameter. Here not used.
 */
static int32_t taskH(uint32_t PID ATTRIB_UNUSED, uint32_t taskParam ATTRIB_UNUSED)
{
    bool success = true;

    /* This should be the task of highest priority, which allows us to omit the code for
       entering and leaving the critical section. */
    _Static_assert(prioEvH == RESOURCE_ALL, "Bad priority configuration");
    //GetResource(RESOURCE_ALL_TASKS);
    ++ mai_cntTaskH;
    ++ mai_cntTotalOfAllTasks;
    ASSERT(checkTotalCount());
    //ReleaseResource();

    return success? 0: -1;

} /* End of taskH */




/**
 * Timer triggered task T, which is of higher priority as tasks A and B.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process. This mechanism is used to report a problem in PRODUCTION
 * compilation, when we have no assertions available.
 *   @param PID
 * The ID of the process, the task function is executed in.
 *   @param taskParam
 * A variable task parameter. Here not used.
 */
static int32_t taskT(uint32_t PID ATTRIB_UNUSED, uint32_t taskParam ATTRIB_UNUSED)
{
    bool success = true;

    GetResource(RESOURCE_ALL);
    ++ mai_cntTaskT;
    ++ mai_cntTotalOfAllTasks;
    ASSERT(checkTotalCount());
    ReleaseResource();

    if((mai_cntTaskT & (1024-1)) == 0)
    {
        const unsigned int noLostActivations = rtos_getNoActivationLoss(idEvTaskT);
        unsigned long long total = (mai_cntTaskT+noLostActivations) / 500;
        const unsigned int h = (unsigned int)(total / 3600ull);
        total -= 3600ull*h;
        const unsigned int min = (unsigned int)(total / 60ull);
        total -= 60ull*min;
        const unsigned int sec = (unsigned int)total;

        iprintf( "%3u:%02u:%02u, cycles: Task S: %llu, tasks A, B, O: %llu,"
                 " task H: %llu, task T: %llu (%u lost activations),"
                 " isrPit1: %llu, isrPit2: %llu, isrPit3: %llu\r\n"
               , h, min, sec
               , mai_cntTaskS
               , mai_cntTaskA
               , mai_cntTaskH
               , mai_cntTaskT
               , noLostActivations
               , mai_cntISRPit1
               , mai_cntISRPit2
               , mai_cntISRPit3
               );
    }

    return success? 0: -1;

} /* End of taskT */




/**
 * Timer triggered supervisor task S. It looks for failures and flashes the LED as long as
 * no failure is recognized.
 *   @return
 * If the task function returns a negative value then the task execution is counted as
 * error in the process. This mechanism is used to report a problem in PRODUCTION
 * compilation, when we have no assertions available.
 *   @param PID
 * The ID of the process, the task function is executed in.
 *   @param taskParam
 * A variable task parameter. Here not used.
 */
static int32_t taskS(uint32_t PID ATTRIB_DBG_ONLY, uint32_t taskParam ATTRIB_UNUSED)
{
    /* This task runs in another process as the supervised tasks. */
    assert(PID == 2);

    ++ mai_cntTaskS;

    const unsigned int stackReserveOs = rtos_getStackReserve(/* PID */ pidOs)
                     , stackReserveP1 = rtos_getStackReserve(/* PID */ 1)
                     , stackReserveP2 = rtos_getStackReserve(/* PID */ 2);

    const bool success = rtos_getNoTotalTaskFailure(/* PID */ 1) == 0
                         &&  rtos_getNoTotalTaskFailure(/* PID */ 2) == 0
                         &&  stackReserveOs >= 3072
                         &&  stackReserveP1 >= 1024
                         &&  stackReserveP2 >= 1024
                         &&  rtos_getNoActivationLoss(idEvTaskA) == 0
                         &&  rtos_getNoActivationLoss(idEvTaskB) == 0
                         &&  rtos_getNoActivationLoss(idEvTaskH) == 0
                         &&  rtos_getNoActivationLoss(idEvTaskS) == 0
                         ;
    if(success)
    {
        /* Normal operation: Let first LED blink at about 1 Hz. */
        lbd_setLED(lbd_led_0_DS11, /* isOn */ (mai_cntTaskS & 32) != 0);
    }
    else if(!rtos_isProcessSuspended(/* PID */ 1))
    {
        lbd_setLED(lbd_led_0_DS11, /* isOn */ false);
        rtos_suspendProcess(/* PID */ 1);
    }
    else
    {
        /* Failure: Let another LED blink at higher rate. */
        lbd_setLED(lbd_led_7_DS4, /* isOn */ (mai_cntTaskS & 16) != 0);
    }

    return success? 0: -1;

} /* End of taskS */




/**
 * This demonstration software uses a number of fast interrupts to produce system load and
 * prove stability. The interrupts are timer controlled (for simplicity) but the
 * activations are chosen as asynchronous to the operating system clock as possible to
 * provoke a most variable preemption pattern.
 */
static void osInstallInterruptServiceRoutines(void)
{
    _Static_assert(prioIrqPit1 >= 1  &&  prioIrqPit1 <= 15
                   &&  prioIrqPit2 >= 1  &&  prioIrqPit2 <= 15
                   &&  prioIrqPit3 >= 1  &&  prioIrqPit3 <= 15
                  , "Interrupt priority out of range"
                  );
    _Static_assert(prioIrqPit1 > RTOS_KERNEL_IRQ_PRIORITY_CORE_0
                   ||  prioIrqPit2 > RTOS_KERNEL_IRQ_PRIORITY_CORE_0
                   ||  prioIrqPit3 > RTOS_KERNEL_IRQ_PRIORITY_CORE_0
                  , "By intention, at least one interrupt should have a priority above the"
                    " scheduler of the RTOS"
                  );
    _Static_assert(prioIrqPit1 < RTOS_KERNEL_IRQ_PRIORITY_CORE_0
                   ||  prioIrqPit2 < RTOS_KERNEL_IRQ_PRIORITY_CORE_0
                   ||  prioIrqPit3 < RTOS_KERNEL_IRQ_PRIORITY_CORE_0
                  , "By intention, at least one interrupt should have a priority below the"
                    " scheduler of the RTOS"
                  );
    _Static_assert(prioIrqPit1 == RTOS_KERNEL_IRQ_PRIORITY_CORE_0
                   ||  prioIrqPit2 == RTOS_KERNEL_IRQ_PRIORITY_CORE_0
                   ||  prioIrqPit3 == RTOS_KERNEL_IRQ_PRIORITY_CORE_0
                  , "By intention, at least one interrupt should have the priority of the"
                    " scheduler of the RTOS"
                  );

    /* Disable timers during configuration. RM, 51.4.1, p. 2731.
         Disable all PIT timers during configuration. Note, this is a global setting for
       all sixteen timers. Accessing the bits makes this rountine have race conditions with
       the RTOS initialization that uses timer #RTOS_CORE_0_IDX_OF_PID_TIMER. Both routines
       must not be called in concurrency. */
    PIT->MCR = PIT_MCR_MDIS(1) | PIT_MCR_FRZ(1);

