PeterVranken/DEVKIT-MPC5748G/samples/safe-RTOS/code/application/testPCP/Z4A/mai_main.c
    /* Initialize the serial output channel as prerequisite of using printf. */
    sio_osInitSerialInterface(/* baudRate */ 115200);

    /* Register the process initialization tasks. */
    bool initOk = true;
    if(rtos_osRegisterInitTask(taskInitProcess, /* PID */ 1, /* tiTaskMaxInUS */ 1000)
       != rtos_err_noError
      )
    {
        initOk = false;
    }


#define CREATE_TASK(name, tiCycleInMs)                                                      \
    if(rtos_osCreateEventProcessor                                                          \
                ( &idEvProc                                                                 \
                , /* tiCycleInMs */               tiCycleInMs                               \
                , /* tiFirstActivationInMs */     0                                         \
                , /* priority */                  prioEv##name                              \
                , /* minPIDToTriggerThisEvProc */ tiCycleInMs == 0                          \
                                                  ? 1                                       \
                                                  : RTOS_EVENT_PROC_NOT_USER_TRIGGERABLE    \
                , /* timerUsesCountableEvents */  false                                     \
                , /* taskParam */                 0                                         \
                )                                                                           \
       == rtos_err_noError                                                                  \
      )                                                                                     \
    {                                                                                       \
        assert(idEvProc == idEvTask##name);                                                 \
        if(rtos_osRegisterUserTask( idEvTask##name                                          \
                                  , task##name                                              \
                                  , pidTask##name                                           \
                                  , /* tiTaskMaxInUs */ 100000                              \
                                  )                                                         \
           != rtos_err_noError                                                              \
          )                                                                                 \
        {                                                                                   \
            initOk = false;                                                                 \
        }                                                                                   \
    }                                                                                       \
    else                                                                                    \
    {                                                                                       \
        initOk = false;                                                                     \
    }
/* End of macro CREATE_TASK */

    /* Create the events that trigger application tasks at the RTOS. Note, we do not really
       respect the ID, which is assigned to the event by the RTOS API rtos_osCreateEventProcessor().
       The returned value is redundant. This technique requires that we create the events
       in the right order and this requires in practice a double-check by assertion - later
       maintenance errors are unavoidable otherwise. */
    unsigned int idEvProc;
    CREATE_TASK(/* name */ A, /* tiCycleInMs */ 0)
    CREATE_TASK(/* name */ B, /* tiCycleInMs */ 0)
    CREATE_TASK(/* name */ H, /* tiCycleInMs */ 0)
    CREATE_TASK(/* name */ T, /* tiCycleInMs */ 2)
    CREATE_TASK(/* name */ S, /* tiCycleInMs */ 13)

    /* Create OS task for same event as triggers task B. O becomes a successor of B. */
    if(rtos_osRegisterOSTask(idEvTaskB, taskO) != rtos_err_noError)
        initOk = false;

    /* The last check ensures that we didn't forget to register a task. */
    assert(initOk &&  idEvProc == noRegisteredEvProcs-1);

    rtos_osGrantPermissionSuspendProcess( /* pidOfCallingTask */ 2 /* Supervisor */
                                        , /* targetPID */ 1        /* Tasks A, B, T, H */
                                        );

    /* Installing irrelated interrupts should be possible before the system is running.
       We place the PIT timer initialization here to prove this statement. */
    osInstallInterruptServiceRoutines();
    del_delayMicroseconds(500000);

    /* Initialize the RTOS kernel. The global interrupt processing is resumed if it
       succeeds. The step involves a configuration check. We must not startup the SW if the
       check fails. */
    if(!initOk ||  rtos_osInitKernel() != rtos_err_noError)
        while(true)
            ;

    /* Here we are in the idle task. */

    bool success ATTRIB_UNUSED = true;
    while(true)
    {
/// @todo Add: osGetResource with level higher than idle but lower than A. Should work with and without osReleaseResource

        /* Trigger the first of the chained test tasks.
             Since we are here in idle, the trigger needs to be always possible. */
        bool evCouldBeTriggered ATTRIB_DBG_ONLY =
                                    rtos_osSendEvent( idEvTaskA
                                                    , /* taskParam */ (uint32_t)mai_cntTaskA
                                                    );
        ASSERT(2*mai_cntTaskIdle+1 == mai_cntTaskA);
        assert(evCouldBeTriggered);

        osGetResource(RESOURCE_ALL);
        ASSERT(2*mai_cntTaskIdle+1 == mai_cntTaskA);
        evCouldBeTriggered = rtos_osSendEvent( idEvTaskA
                                             , /* taskParam */ (uint32_t)mai_cntTaskA
                                             );
        ASSERT(2*mai_cntTaskIdle+1 == mai_cntTaskA);
        osReleaseResource();
        ASSERT(2*mai_cntTaskIdle+2 == mai_cntTaskA);
        assert(evCouldBeTriggered);

        /* Make spinning of the idle task observable in the debugger. */
        osGetResource(RESOURCE_ALL);
        ++ mai_cntTaskIdle;
        ++ mai_cntTotalOfAllTasks;
        osReleaseResource();

    } /* End of inifinite idle loop of RTOS. */

    /* We never get here. Just to avoid a compiler warning. */
    return -1;

} /* End of main */
